# TemperatureRatingTypeSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSetIterator Class
Members See Also
---
An iterator to a TemperatureRating type set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class TemperatureRatingTypeSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class TemperatureRatingTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class TemperatureRatingTypeSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeSetIterator
# See Also
TemperatureRatingTypeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace